
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>EOS分享复盘 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../chapter3/DIFINITY.html" />
    
    
    <link rel="prev" href="../chapter1/AELF.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../chapter1/AELF.html">
            
                <a href="../chapter1/AELF.html">
            
                    
                    AELF分享复盘
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.2" data-path="EOS.html">
            
                <a href="EOS.html">
            
                    
                    EOS分享复盘
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../chapter3/DIFINITY.html">
            
                <a href="../chapter3/DIFINITY.html">
            
                    
                    Dfinity系列（一）——分层架构、阈值接力
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="../chapter4/ERC20.html">
            
                <a href="../chapter4/ERC20.html">
            
                    
                    erc20发币实践
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >EOS分享复盘</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="eos&#x5206;&#x4EAB;&#x590D;&#x76D8;">EOS&#x5206;&#x4EAB;&#x590D;&#x76D8;</h1>
<h2 id="&#x6458;&#x8981;">&#x6458;&#x8981;</h2>
<p>&#x2003;&#x2003;&#x73B0;&#x6709;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x7CFB;&#x7EDF;&#x5927;&#x591A;&#x6709;&#x7740;&#x4EA4;&#x6613;&#x901F;&#x5EA6;&#x6162;&#x3001;&#x96BE;&#x4EE5;&#x6784;&#x5EFA;DAPP&#x7B49;&#x5C40;&#x9650;&#xFF0C;&#x800C;EOS&#x62AB;&#x7740;ethereum2.0&#x7684;&#x540D;&#x5934;&#x51FA;&#x73B0;&#x5728;&#x4EBA;&#x4EEC;&#x773C;&#x524D;&#xFF0C;&#x8BA9;&#x4EBA;&#x4E0D;&#x660E;&#x89C9;&#x91CC;&#x3002;&#x5728;&#x672C;&#x6B21;&#x5206;&#x4EAB;&#x4E2D;&#xFF0C;&#x6C42;&#x77E5;&#x82E5;&#x6E34;&#x7684;&#x674E;&#x8001;&#x5E08;&#x5C06;&#x4ECE;EOS&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;DPOS&#x3001;&#x8D26;&#x6237;/&#x6D88;&#x606F;/&#x6743;&#x9650;&#x3001;&#x5E76;&#x884C;&#x5904;&#x7406;&#x3001;token&#x6A21;&#x578B;&#x53CA;&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#x3001;governance&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BB2;&#x89E3;&#xFF0C;&#x5E2E;&#x52A9;&#x5927;&#x5BB6;&#x66F4;&#x6E05;&#x695A;&#x5730;&#x8BA4;&#x8BC6;EOS&#x5230;&#x5E95;&#x662F;&#x662F;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;OS&#x3002;</p>
<h2 id="&#x5206;&#x4EAB;&#x52A8;&#x673A;">&#x5206;&#x4EAB;&#x52A8;&#x673A;</h2>
<p>&#x2003;&#x2003;&#x674E;&#x8001;&#x5E08;&#x8FD9;&#x6B21;&#x5206;&#x4EAB;&#x7684;&#x52A8;&#x673A;&#xFF0C;&#x603B;&#x7684;&#x6765;&#x8BF4;&#x662F;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;&#x5BF9;&#x672A;&#x77E5;&#x7684;&#x6050;&#x60E7;&#x3001;&#x5BF9;&#x77E5;&#x8BC6;&#x7684;&#x597D;&#x5947;&#x3001;&#x5BF9;&#x771F;&#x76F8;&#x7684;&#x63A2;&#x6C42;&#xFF08;&#x770B;&#x674E;&#x8001;&#x5E08;&#x89C9;&#x609F;&#x591A;&#x9AD8;&#xFF01;&#xFF09;&#x3002;&#x5177;&#x4F53;&#x4E3A;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<ol>
<li><p>EOS&#x53F7;&#x79F0;&#x4EE5;&#x592A;&#x574A;2.0,6&#x6708;&#x4E0E;ETH&#x5FC5;&#x6709;&#x4E00;&#x6218;&#xFF0C;&#x674E;&#x8001;&#x5E08;&#x4F5C;&#x4E3A;eth&#x6301;&#x6709;&#x8005;&#xFF0C;&#x745F;&#x745F;&#x53D1;&#x6296;&#xFF1B;</p>
</li>
<li><p>EOS&#x4F5C;&#x4E3A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x53F7;&#x79F0;&#x80FD;&#x652F;&#x6301;&#x6BCF;&#x79D2;&#x4E09;&#x5341;&#x4E07;&#x6B21;&#x7684;&#x4EA4;&#x6613;&#xFF1B;</p>
</li>
<li><p>EOS&#x6709;&#x5DE8;&#x5927;&#x4E89;&#x8BAE;&#xFF0C;&#x6BD4;&#x5982;&#x4ED6;&#x7684;&#x4E2D;&#x5FC3;&#x5316;&#x8BBE;&#x8BA1;&#xFF0C;&#x4ED6;&#x7684;&#x7ECF;&#x6D4E;&#x5B66;token&#x6A21;&#x578B;&#x4E0D;&#x9760;&#x8C31;&#xFF1B;</p>
</li>
</ol>
<h2 id="eos&#x7684;&#x8BDE;&#x751F;">EOS&#x7684;&#x8BDE;&#x751F;</h2>
<ul>
<li><p><strong>BM&#x5176;&#x4EBA;&#xFF08;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x5C31;&#x81EA;&#x884C;&#x767E;&#x5EA6;&#x5427;= =&#xFF09;</strong></p>
</li>
<li><p><strong>&#x73B0;&#x6709;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x7684;&#x95EE;&#x9898;</strong></p>
</li>
<li><p><strong>EOS&#x8981;&#x8FBE;&#x5230;&#x7684;&#x76EE;&#x7684;</strong></p>
<ol>
<li>Support Millions of users</li>
<li>Free usage</li>
<li>Easy upgrade and bug recovery</li>
<li>Low latency</li>
<li>Sequential performance</li>
<li>Parallel performance</li>
</ol>
</li>
<li><p><strong>EOS&#x7684;&#x5F00;&#x53D1;&#x80CC;&#x666F;</strong></p>
</li>
</ul>
<h2 id="dpos">DPOS</h2>
<ul>
<li><p><strong>DPOS&#x7684;&#x7B80;&#x4ECB;</strong></p>
<p>  &#x2003;&#x2003;&#x73B0;&#x6709;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x5206;&#x4E3A;&#x4E24;&#x5927;&#x6D41;&#x6D3E;&#xFF1A;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x4E0E;&#x6743;&#x76CA;&#x8BC1;&#x660E;&#xFF0C;DPOS&#x5C5E;&#x4E8E;&#x540E;&#x8005;&#xFF0C;&#x59D4;&#x6258;&#x6388;&#x6743;&#x7684;&#x6743;&#x76CA;&#x8BC1;&#x660E;&#x3002;</p>
</li>
<li><p><strong>DPOS&#x7684;&#x8FC7;&#x7A0B;</strong></p>
<ol>
<li>&#x6295;&#x7968;&#x9636;&#x6BB5;&#xFF1A;&#x6709;EOS token&#x7684;&#x90FD;&#x6709;&#x6295;&#x7968;&#x6743;&#xFF0C;&#x8FDE;&#x7EED;&#x6295;&#x7968;&#x9009;&#x62E9;&#x51FA;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x673A;&#x4F1A;&#x53C2;&#x4E0E;&#x7ADE;&#x9009;&#xFF0C;&#x83B7;&#x5F97;&#x6700;&#x591A;&#x6295;&#x7968;&#x7684;&#x83B7;&#x80DC;&#x3002;</li>
<li>&#x751F;&#x4EA7;&#x533A;&#x5757;&#x9636;&#x6BB5;&#xFF1A;&#x9009;&#x51FA;&#x6765;&#x7684;&#x751F;&#x4EA7;&#x8005;&#x968F;&#x673A;&#x8F6E;&#x6D41;&#x751F;&#x4EA7;&#x533A;&#x5757;&#x3002;</li>
</ol>
</li>
<li><p><strong>&#x7B80;&#x5355;&#x4E3E;&#x4F8B;</strong></p>
<p>  &#x2003;&#x2003;&#x5047;&#x8BBE;&#x7FA4;&#x91CC;&#x8FD9;&#x5E2E;&#x4EBA;&#x6BCF;&#x4EBA;&#x6709;&#x4E2A;&#x8D26;&#x6237;&#xFF0C;&#x8D26;&#x6237;&#x4E2D;&#x6709;&#x4E00;&#x5B9A;&#x91CF;&#x7684;token&#xFF0C;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#x4E00;&#x8F6E;DPOS&#x8FC7;&#x7A0B;&#x3002;&#x8BBE;N=3&#xFF08;&#x5373;&#x4E09;&#x4E2A;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#xFF09;&#xFF0C;&#x73B0;&#x5728;&#x6709;4&#x4E2A;&#x8D26;&#x6237;&#x8981;&#x7ADE;&#x9009;&#x751F;&#x4EA7;&#x8005;&#xFF08;&#x8001;&#x8463;&#x3001;frank&#x3001;&#x73ED;&#x957F;&#x5C0F;&#x59D0;&#x59D0;&#x3001;&#x674E;&#x8001;&#x5E08;&#xFF09;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6295;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x6295;&#x7684;&#x4EBA;&#xFF0C;&#x800C;&#x6295;&#x7968;&#x7684;&#x6743;&#x91CD;&#x5219;&#x662F;&#x81EA;&#x5DF1;token&#x6240;&#x5360;&#x6240;&#x6709;token&#x7684;&#x6BD4;&#x4F8B;&#x3002;&#x6295;&#x7968;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x4E0D;&#x540C;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x89C4;&#x5B9A;&#x6BCF;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x591A;&#x6295;&#xFF0C;&#x4F46;&#x662F;&#x6295;&#x7684;&#x4EBA;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;&#x4E24;&#x4E2A;&#x4EBA;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x6295;&#x7968;&#x8FC7;&#x7A0B;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#xFF0C;&#x8001;&#x8463;&#x3001;frank&#x3001;&#x73ED;&#x957F;&#x5C0F;&#x59D0;&#x59D0;&#x6240;&#x5F97;&#x7968;&#x6570;&#x4F4D;&#x5C45;&#x4E09;&#x7532;&#xFF0C;&#x5219;&#x4ED6;&#x4EEC;&#x88AB;&#x9009;&#x5165;&#x4F5C;&#x4E3A;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#xFF0C;&#x674E;&#x8001;&#x5E08;&#x8D2C;&#x4E3A;&#x5EB6;&#x6C11;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x5F00;&#x59CB;&#x751F;&#x4EA7;&#x533A;&#x5757;&#x9636;&#x6BB5;&#x3002;&#x7531;&#x4E8E;&#x9009;&#x51FA;&#x7684;&#x751F;&#x4EA7;&#x8005;&#x4E3A;&#x8001;&#x8463;&#x3001;frank&#x3001;&#x73ED;&#x957F;&#x5C0F;&#x59D0;&#x59D0;&#xFF0C;&#x5219;&#x5C06;&#x4ED6;&#x4EEC;shuffle&#x4E00;&#x4E0B;&#xFF0C;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x751F;&#x4EA7;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x4E09;&#x4E2A;&#x533A;&#x5757;&#x4E3A;&#x4E00;&#x8F6E;&#xFF08;N==3&#xFF09;&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x987A;&#x5E8F;&#x751F;&#x4EA7;&#x533A;&#x5757;&#xFF0C;&#x6BCF;&#x4E00;&#x8F6E;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#xFF0C;shuffle&#x4E00;&#x4E0B;&#x7EE7;&#x7EED;&#x751F;&#x4EA7;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;DPOS&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x3002;EOS&#x7684;&#x5177;&#x4F53;DPOS&#x8FC7;&#x7A0B;&#x4F1A;&#x7A0D;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x5982;&#x53C2;&#x6570;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x9009;&#x4E3E;&#x89C4;&#x5219;&#x7684;&#x4E0D;&#x540C;&#x7B49;&#xFF0C;&#x4F46;&#x662F;&#x4E07;&#x53D8;&#x4E0D;&#x79BB;&#x5176;&#x5B97;&#x3002;</p>
<p>  &#x2003;&#x2003;DPOS&#x5B9A;&#x4E49;&#x6700;&#x957F;&#x94FE;&#x4E3A;&#x5171;&#x8BC6;&#x94FE;&#xFF0C;&#x5728;&#x6B63;&#x5E38;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6240;&#x6709;21&#x4E2A;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#x90FD;&#x6B63;&#x5E38;&#x53C2;&#x4E0E;&#x533A;&#x5757;&#x7684;&#x9A8C;&#x8BC1;&#xFF0C;&#x56E0;&#x6B64;1.5&#x79D2;&#x540E;&#x5219;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x786E;&#x8BA4;&#xFF08;&#x8FD9;&#x91CC;&#x674E;&#x8001;&#x5E08;&#x6709;&#x4E2A;&#x7591;&#x95EE;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x60F3;&#x660E;&#x767D;&#xFF0C;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x8BA8;&#x8BBA;&#x8BA8;&#x8BBA;&#x5427;&#xFF09;&#x3002;</p>
</li>
</ul>
<p><img src="https://i.imgur.com/RZzZTdq.png" alt=""></p>
<p><img src="https://i.imgur.com/wzw53lN.png" alt=""></p>
<ul>
<li><p><strong>&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x53CA;&#x5904;&#x7406;</strong></p>
<p>  &#x2003;&#x2003;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF1A;1. &#x6076;&#x610F;&#x7684;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#xFF1B;2. &#x7F51;&#x7EDC;&#x62E5;&#x585E;&#xFF1B;3. &#x67D0;&#x4E2A;&#x751F;&#x4EA7;&#x8005;&#x5B95;&#x673A;&#xFF1B;4. &#x53D1;&#x751F;&#x4E86;fork&#x3002;</p>
<p>  &#x2003;&#x2003;&#x5173;&#x4E8E;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x7684;&#x5904;&#x7406;&#x548C;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#xFF0C;&#x653E;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x5B66;&#x4E60;&#xFF1A;<a href="https://steemit.com/dpos/@dantheman/dpos-consensus-algorithm-this-missing-white-paper" target="_blank">DPOS&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x7684;&#x5904;&#x7406;&#x548C;&#x8BC1;&#x660E;</a> &#x3002;&#x6587;&#x7AE0;&#x5217;&#x51FA;&#x4E86;&#x4E03;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x7ECF;&#x8FC7;&#x63A8;&#x6F14;&#xFF0C;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x8BBA;&#x662F;&#xFF1A;&#x5F53;&#x5C11;&#x6570;&#x751F;&#x4EA7;&#x8005;&#x4F5C;&#x6076;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;DPOS&#x90FD;&#x5728;&#x5DF2;&#x77E5;&#x5F02;&#x5E38;&#x548C;&#x653B;&#x51FB;&#x4E0B;&#x662F;&#x53EF;&#x9760;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x591A;&#x6570;&#x751F;&#x4EA7;&#x8005;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x793E;&#x533A;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6295;&#x7968;&#x7684;&#x65B9;&#x5F0F;&#x53D6;&#x7F14;&#x8FD9;&#x4E9B;&#x751F;&#x4EA7;&#x8005;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x867D;&#x7136;&#x8BF4;&#x662F;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x91CC;&#x8BC1;&#x660E;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x4E3E;&#x53CD;&#x8BC1;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x4F8B;&#x5B50;&#x6CA1;&#x6709;&#x4E3E;&#x51FA;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6837;&#x7684;&#x8BC1;&#x660E;&#x53EF;&#x80FD;&#x4E0D;&#x592A;&#x4E25;&#x8C28;&#x3002;&#x4F46;&#x662F;bitshares&#x548C;steemit&#x4E00;&#x76F4;&#x8FD0;&#x884C;&#x826F;&#x597D;&#xFF0C;&#x53EA;&#x6709;&#x59D1;&#x4E14;&#x8BA4;&#x4E3A;&#x4ED6;&#x662F;&#x53EF;&#x9760;&#x5730;&#x3002;</p>
</li>
<li><p><strong>DPOS&#x4F18;&#x52BF;</strong></p>
<ol>
<li>&#x56E0;&#x4E3A;&#x5C11;&#x91CF;&#x7684;&#x751F;&#x4EA7;&#x8005;&#x4EE5;&#x534F;&#x4F5C;&#x7684;&#x65B9;&#x5F0F;&#x786E;&#x5B9A;&#x6027;&#x5730;&#x751F;&#x4EA7;&#x533A;&#x5757;&#xFF0C;&#x6240;&#x4EE5;&#x4EA7;&#x751F;&#x7684;latency&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x901F;&#x5EA6;&#x5FEB;&#xFF1B;</li>
<li><p>&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#x7684;&#x5B58;&#x5728;&#x7ED9;governance&#x63D0;&#x4F9B;&#x4E86;&#x673A;&#x4F1A;&#xFF0C;&#x5373;&#x4E3B;&#x89C2;&#x4EA7;&#x751F;&#x5171;&#x8BC6;&#x3002;</p>
<p>&#x2003;&#x2003;&#x4ECE;bitshare&#x548C;steemit&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x7684;&#x60C5;&#x51B5;&#x6765;&#x770B;&#xFF0C;DPOS&#x786E;&#x5B9E;&#x5E26;&#x6765;&#x4E86;&#x4F18;&#x5F02;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x671F;&#x5F85;EOS&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x541E;&#x5410;&#x91CF;&#x975E;&#x5E38;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<h2 id="&#x8D26;&#x6237;&#x3001;&#x6D88;&#x606F;&#x3001;&#x6743;&#x9650;">&#x8D26;&#x6237;&#x3001;&#x6D88;&#x606F;&#x3001;&#x6743;&#x9650;</h2>
</li>
</ol>
</li>
<li><p><strong>&#x8D26;&#x6237;</strong></p>
<p>  &#x2003;&#x2003;EOS&#x63D0;&#x4F9B;&#x8D26;&#x6237;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x8BBE;&#x8BA1;&#x6216;&#x8005;&#x529F;&#x80FD;&#x3002;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x7531;2&#x5230;32&#x5B57;&#x7B26;&#x547D;&#x540D;&#xFF0C;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x79C1;&#x6709;&#x7684;database&#xFF0C;&#x8D26;&#x6237;&#x53EF;&#x4EE5;&#x5411;&#x5176;&#x4ED6;&#x8D26;&#x6237;&#x53D1;&#x9001;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x7ED3;&#x6784;&#x5316;&#x6D88;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#x7531;&#x5177;&#x4F53;&#x7684;&#x6D88;&#x606F;&#x5904;&#x7406;&#x51FD;&#x6570;&#x5904;&#x7406;&#x3002;&#x8D26;&#x6237;&#x6D88;&#x606F;&#x5904;&#x7406;&#x548C;code&#x5219;&#x7EC4;&#x6210;&#x4E86;EOS&#x7684;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x3002;</p>
</li>
<li><p><strong>&#x6743;&#x9650;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;</strong></p>
<p>  &#x2003;&#x2003;EOS&#x7684;&#x8D26;&#x6237;&#x91CC;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x5957;&#x57FA;&#x4E8E;&#x89D2;&#x8272;&#x6743;&#x9650;&#x7684;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x7528;&#x6765;&#x5224;&#x65AD;&#x6D88;&#x606F;&#x662F;&#x5426;&#x7B26;&#x5408;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x6743;&#x9650;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x81EA;&#x5B9A;&#x4E49;&#x547D;&#x540D;&#x7684;&#x6743;&#x9650;&#x7B49;&#x7EA7;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B49;&#x7EA7;&#x4E4B;&#x95F4;&#x6709;&#x7EE7;&#x627F;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x7236;&#x7B49;&#x7EA7;&#x5C06;&#x62E5;&#x6709;&#x5B50;&#x7B49;&#x7EA7;&#x7684;&#x6240;&#x6709;&#x6743;&#x9650;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x540C;&#x65F6;&#xFF0C;EOS&#x91CC;&#x53C8;&#x6709;&#x6D88;&#x606F;&#x5904;&#x7406;&#x51FD;&#x6570;&#x7EC4;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8D26;&#x6237;&#x7684;&#x6D88;&#x606F;&#x53EF;&#x4EE5;&#x7528;&#x7EC4;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x4FBF;&#x4E8E;&#x5206;&#x914D;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF0C;&#x8FD9;&#x4E2A;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;namespace&#x3002;&#x5728;&#x6743;&#x9650;&#x7B49;&#x7EA7;&#x548C;&#x6D88;&#x606F;&#x5904;&#x7406;&#x51FD;&#x6570;&#x4E4B;&#x95F4;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x79CD;&#x6743;&#x9650;&#x6620;&#x5C04;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5224;&#x65AD;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x5C31;&#x662F;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x58F0;&#x660E;&#x5F0F;&#x7684;&#x65B9;&#x6CD5;&#x5B9A;&#x4E49;&#x6743;&#x9650;&#xFF0C;&#x5728;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x540E;&#xFF0C;&#x7531;EOS&#x8F6F;&#x4EF6;&#x6765;&#x68C0;&#x67E5;&#x6743;&#x9650;&#xFF0C;&#x786E;&#x5B9A;&#x6D88;&#x606F;&#x5904;&#x7406;&#x51FD;&#x6570;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x88AB;&#x8C03;&#x7528;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x4EE5;&#x4E0B;&#x662F;EOS&#x767D;&#x76AE;&#x4E66;&#x4E2D;&#x6743;&#x9650;&#x6620;&#x5C04;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x53EF;&#x4EE5;&#x5728;&#x767D;&#x76AE;&#x4E66;&#x91CC;&#x770B;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x505A;&#x4E00;&#x4E2A;&#x5C55;&#x793A;&#x3002;</p>
</li>
</ul>
<p><img src="https://i.imgur.com/OEBKCNI.png" alt=""></p>
<ul>
<li><p><strong>&#x6743;&#x9650;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x521D;&#x8877;</strong></p>
<p>  &#x2003;&#x2003;&#x8D26;&#x6237;&#x6743;&#x9650;&#x7684;&#x529F;&#x80FD;&#x4E3A;&#x4F55;&#x4E0D;&#x653E;&#x5728;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x8BA9;&#x8D26;&#x6237;&#x81EA;&#x5DF1;&#x6765;&#x505A;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x653E;&#x5728;&#x5E95;&#x5C42;&#xFF0C;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7CDF;&#x7CD5;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x5982;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x7684;solidity&#x5B66;&#x4E60;&#x4E2D;&#x591A;&#x5458;&#x5DE5;&#x85AA;&#x916C;&#x7CFB;&#x7EDF;&#xFF0C;onlyOwner&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x6743;&#x9650;&#x7BA1;&#x7406;&#x3002;&#x5173;&#x4E8E;&#x8FD9;&#x4E00;&#x70B9;EOS&#x662F;&#x8FD9;&#x6837;&#x89E3;&#x91CA;&#x7684;&#xFF0C;&#x628A;&#x6743;&#x9650;&#x7BA1;&#x7406;&#x6807;&#x51C6;&#x5316;&#xFF0C;&#x5E76;&#x4ECE;dapp&#x4E2D;&#x5265;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x597D;&#x5904;&#xFF1A;1.&#x4FBF;&#x4E8E;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#xFF0C;&#x7528;&#x4E00;&#x79CD;&#x901A;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x7BA1;&#x7406;&#x6743;&#x9650;&#xFF1B;2.&#x63D0;&#x4F9B;&#x4E86;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x7B2C;&#x4E00;&#x70B9;&#x6709;&#x70B9;&#x865A;&#xFF0C;&#x6D89;&#x53CA;&#x5230;&#x5F88;&#x591A;&#x5C0F;&#x70B9;&#xFF1B;&#x7B2C;&#x4E8C;&#x70B9;&#x5728;EOS&#x7684;&#x767D;&#x76AE;&#x4E66;&#x91CC;&#x505A;&#x4E86;&#x8BE6;&#x7EC6;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x6743;&#x9650;&#x8BA1;&#x7B97;&#xFF0C;&#x662F;&#x4E00;&#x79CD;readonly&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD9;&#x6837;&#x610F;&#x5473;&#x7740;&#x6240;&#x6709;&#x7684;&#x6743;&#x9650;&#x9A8C;&#x8BC1;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x8FDB;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x6743;&#x9650;&#x9A8C;&#x8BC1;&#x5360;&#x4E86;&#x6240;&#x6709;&#x8BA1;&#x7B97;&#x7684;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x6BD4;&#x4F8B;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x4F18;&#x5316;&#x53EF;&#x4EE5;&#x5F88;&#x5927;&#x5730;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x6D88;&#x606F;&#x5904;&#x7406;&#x51FD;&#x6570;&#x90FD;&#x6709;&#x6743;&#x9650;&#x9A8C;&#x8BC1;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x6837;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x5BF9;&#x6743;&#x9650;&#x9A8C;&#x8BC1;&#x90E8;&#x5206;&#x505A;&#x5355;&#x72EC;&#x7684;&#x5E76;&#x884C;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x4EA4;&#x7ED9;&#x7528;&#x6237;&#x8D27;&#x770B;&#x5F00;&#x53D1;&#x8005;&#x7684;code&#x6765;&#x505A;&#xFF0C;&#x662F;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x5E76;&#x884C;&#x5904;&#x7406;&#x7684;&#x3002;&#x8FD9;&#x91CC;&#x4F53;&#x73B0;&#x51FA;EOS&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#xFF0C;&#x8FFD;&#x6C42;&#x6781;&#x81F4;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
</li>
<li><p><strong>&#x79C1;&#x94A5;&#x6062;&#x590D;&#x673A;&#x5236;</strong></p>
<p>  &#x2003;&#x2003;EOS&#x8D26;&#x6237;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7279;&#x8272;&#xFF0C;&#x5C31;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x6062;&#x590D;&#x673A;&#x5236;&#xFF0C;&#x5904;&#x7406;&#x79C1;&#x94A5;&#x88AB;&#x76D7;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8D26;&#x6237;&#x7684;&#x79C1;&#x94A5;&#x4E00;&#x65E6;&#x88AB;&#x76D7;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FC7;&#x53BB;&#x4E09;&#x5341;&#x5929;&#x5185;&#x7684;active&#x7684;ownerkey&#x7ED3;&#x5408;&#x8D26;&#x6237;&#x7684;partner&#x6765;reset ownerkey&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x5173;&#x952E;&#x662F;&#x8D26;&#x6237;&#x7684;partner&#xFF0C;&#x8FD9;&#x91CC;&#x6BD4;&#x5982;&#x8BF4;&#x90AE;&#x4EF6;&#x9A8C;&#x8BC1;&#x3001;&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#x4E4B;&#x7C7B;&#x6765;&#x9A8C;&#x8BC1;&#x7528;&#x6237;&#x7684;&#x8EAB;&#x4EFD;&#x3002;&#x8FD9;&#x91CC;&#x53C8;&#x4F53;&#x73B0;&#x51FA;&#x4E86;EOS&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#xFF0C;&#x4ECE;&#x7528;&#x6237;&#x573A;&#x666F;&#x8003;&#x8651;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x5F88;&#x9AD8;&#x7EA7;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
</li>
</ul>
<h2 id="&#x5E76;&#x884C;&#x6267;&#x884C;">&#x5E76;&#x884C;&#x6267;&#x884C;</h2>
<p>&#x2003;&#x2003;&#x5E76;&#x884C;&#x6267;&#x884C;&#x662F;EOS&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x800C;&#x6709;&#x8DA3;&#x7684;&#x5730;&#x65B9;&#x3002;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5171;&#x8BC6;&#x9700;&#x8981;&#x786E;&#x5B9A;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x800C;EOS&#x9700;&#x8981;&#x7528;&#x5E76;&#x884C;&#x5904;&#x7406;&#x6765;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x8FD9;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x6311;&#x6218;&#x3002;</p>
<ul>
<li><p><strong>&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;</strong></p>
<p>  &#x2003;&#x2003;&#x533A;&#x5757;&#x94FE;&#x5171;&#x8BC6;&#xFF0C;&#x662F;&#x4F9D;&#x8D56;&#x4E8E;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;reproduce&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x5230;&#x7B2C;N&#x4E2A;&#x533A;&#x5757;&#x5E94;&#x8BE5;&#x4EA7;&#x751F;&#x552F;&#x4E00;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x4E2A;&#x4EE5;&#x533A;&#x5757;&#x4E3A;&#x8F93;&#x5165;&#x7684;&#x786E;&#x5B9A;&#x72B6;&#x6001;&#x673A;&#x3002;</p>
<p>  &#x2003;&#x2003;EOS&#x4E3A;&#x4E86;&#x8BA9;DAPP&#x5927;&#x89C4;&#x6A21;&#x5E76;&#x53D1;&#x8FD0;&#x884C;&#xFF0C;&#x9700;&#x8981;&#x5F15;&#x5165;horizontal skill&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x5FC5;&#x7136;&#x662F;&#x67D0;&#x79CD;multi-thread&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#xFF08;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x7684;thread&#x662F;thread of execution&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x72ED;&#x4E49;&#x4E2D;OS&#x91CC;&#x7684;thread)</p>
<p>  &#x2003;&#x2003;EOS&#x8981;&#x91C7;&#x7528;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x8BBE;&#x8BA1;&#xFF0C;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x4E32;&#x884C;&#x5730;&#x5904;&#x7406;&#x6D88;&#x606F;&#xFF0C;&#x800C;&#x5728;&#x8D26;&#x6237;&#x7684;&#x7C92;&#x5EA6;&#x8FDB;&#x884C;&#x5E76;&#x884C;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x540C;&#x65F6;EOS&#x4E5F;&#x8981;&#x89E3;&#x51B3;&#x5EF6;&#x65F6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x5EF6;&#x65F6;&#x5F88;&#x5173;&#x952E;&#xFF0C;EOS&#x8BA4;&#x4E3A;&#x4E09;&#x79D2;&#x7684;block&#x65F6;&#x95F4;&#x5BF9;&#x4E8E;&#x6D88;&#x606F;&#x5EF6;&#x65F6;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x8D26;&#x6237;&#x95F4;&#x9700;&#x8981;&#x6765;&#x56DE;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x7D2F;&#x79EF;&#x5EF6;&#x65F6;&#x4F1A;&#x975E;&#x5E38;&#x957F;&#x3002;</p>
</li>
<li><p><strong>&#x89E3;&#x51B3;&#x7684;&#x65B9;&#x5F0F;</strong></p>
<p>  &#x2003;&#x2003;&#x90A3;&#x9488;&#x5BF9;&#x4E0A;&#x8FF0;&#x95EE;&#x9898;&#xFF0C;EOS&#x5BF9;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x6D88;&#x606F;&#x7684;&#x7EA7;&#x522B;&#x8FDB;&#x884C;&#x4E86;&#x5212;&#x5206;&#xFF0C;&#x8BBE;&#x8BA1;&#x4E86;block&#x3001;cycles&#x3001;threads&#x3001;transactions&#x3001;messages&#x3001;receiver and notified accounts&#x8FD9;&#x51E0;&#x4E2A;&#x7EA7;&#x522B;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x90FD;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x5176;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;cycle&#x91CC;&#x6709;&#x591A;&#x4E2A;thread&#x5E76;&#x884C;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x662F;EOS&#x4E3B;&#x8981;&#x4F18;&#x5316;&#x6027;&#x80FD;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5373;&#x4E00;&#x79CD;horizontal-skill&#x3002;EOS&#x7684;&#x6D88;&#x606F;&#x662F;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;cycle&#x91CC;&#x7684;&#x4EE3;&#x7801;&#x53D1;&#x8D77;&#x6D88;&#x606F;&#xFF0C;&#x5FC5;&#x987B;schedule&#x5230;&#x4E0B;&#x4E00;&#x4E2A;cycle&#x91CC;&#x6267;&#x884C;&#x3002;</p>
<p>  &#x2003;&#x2003;EOS&#x7528;&#x4E0A;&#x8FF0;&#x8BBE;&#x8BA1;&#xFF0C;&#x6765;&#x5904;&#x7406;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x6027;&#x80FD;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x96BE;&#x770B;&#x51FA;&#x8FD9;&#x91CC;&#x7684;&#x5173;&#x952E;&#x95EE;&#x9898;&#x662F;&#x8C03;&#x5EA6;&#xFF0C;&#x628A;&#x6240;&#x6709;&#x7684;&#x6D88;&#x606F;&#x5B89;&#x6392;&#x5230;&#x4E0D;&#x540C;&#x7684;thread&#x91CC;&#x5E76;&#x884C;&#x6267;&#x884C;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD9;&#x79CD;&#x8C03;&#x5EA6;&#x5C31;&#x662F;21&#x4E2A;&#x88AB;&#x9009;&#x51FA;&#x6765;&#x7684;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x65B9;&#x6848;&#x6765;&#x4EA7;&#x751F;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x8C03;&#x5EA6;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x79CD;&#x8C03;&#x5EA6;&#x4F1A;&#x4EA7;&#x751F;&#x552F;&#x4E00;&#x7684;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x8FD9;&#x91CC;&#x8C03;&#x5EA6;&#x7684;&#x7EA6;&#x675F;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x8D26;&#x6237;&#x91CC;&#x5199;&#x72B6;&#x6001;message&#xFF0C;&#x4E0D;&#x80FD;&#x518D;&#x540C;&#x4E00;cycle&#x7684;&#x591A;&#x4E2A;thread&#x91CC;&#x6267;&#x884C;&#x3002;</p>
</li>
</ul>
<p><img src="https://i.imgur.com/L4ZOuS1.png" alt=""></p>
<ul>
<li><p><strong>&#x5176;&#x4ED6;&#x5E76;&#x884C;&#x4F18;&#x5316;&#x7684;&#x5DE5;&#x4F5C;</strong></p>
<p>  &#x2003;&#x2003;EOS&#x7684;&#x5E76;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x8FD8;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;&#x53EA;&#x8BFB;&#x7684;&#x6D88;&#x606F;&#x5904;&#x7406;&#x51FD;&#x6570;&#x7684;&#x5E76;&#x884C;&#x4F18;&#x5316;&#x5904;&#x7406;&#xFF08;&#x7C7B;&#x6743;&#x9650;&#x7BA1;&#x7406;&#xFF09;&#xFF1B;&#x6BD4;&#x5982;&#x5BF9;&#x591A;&#x6D88;&#x606F;&#x591A;&#x8D26;&#x6237;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x5904;&#x7406;&#x7B49;&#x7B49;&#x3002;&#x8BE6;&#x89C1;&#x767D;&#x76AE;&#x4E66;&#x3002;</p>
</li>
<li><p><strong>&#x8BFE;&#x5802;&#x4F5C;&#x4E1A;</strong></p>
<ol>
<li>&#x6211;&#x4EEC;&#x8BF4;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x5FC5;&#x987B;&#x53EF;&#x4EE5;replay&#xFF0C;&#x4F46;&#x662F;EOS&#x5F15;&#x5165;&#x4E86;&#x5E76;&#x884C;&#x5904;&#x7406;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4F7F;&#x5F97;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5185;&#x7684;transaction&#x53EF;&#x80FD;&#x5728;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#xFF0C;&#x4E3A;&#x4E86;&#x8FBE;&#x5230; replay&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#xFF0C;&#x4E0A;&#x56FE;&#x4E2D;block&#x3001;cycle&#x3001;thread&#x3001;transaction&#x3001;meassage&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x54EA;&#x4E9B;&#x5FC5;&#x987B;&#x8BB0;&#x5F55;&#x5728;&#x533A;&#x5757;&#x91CC;&#x5462;&#xFF1F;</li>
<li>&#x5199;&#x51FA;&#x4E00;&#x4E2A;&#x6700;&#x7B80;&#x5355;&#x7684;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#x3002;</li>
</ol>
</li>
</ul>
<h2 id="&#x8D39;&#x7528;&#x6A21;&#x578B;&#x53CA;&#x8D44;&#x6E90;&#x4F7F;&#x7528;">&#x8D39;&#x7528;&#x6A21;&#x578B;&#x53CA;&#x8D44;&#x6E90;&#x4F7F;&#x7528;</h2>
<p>&#x2003;&#x2003;Token&#x662F;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x4EE3;&#x8868;&#x7740;&#x533A;&#x5757;&#x94FE;&#x8D44;&#x6E90;&#x7684;&#x4F7F;&#x7528;&#x6743;&#xFF0C;&#x4ECE;&#x800C;&#x51B3;&#x5B9A;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x8D44;&#x6E90;&#x5206;&#x914D;&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x90FD;&#x56F4;&#x7ED5;token&#x4EA7;&#x751F;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;&#x6743;&#x7684;&#x8BBE;&#x8BA1;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;Ethereum&#x548C;EOS&#x7684;&#x8BBE;&#x8BA1;&#x5C31;&#x6B63;&#x597D;&#x76F8;&#x53CD;&#x3002;</p>
<ul>
<li><p><strong>ethereum&#x4E0E;EOS&#x8D39;&#x7528;&#x6A21;&#x578B;&#x7684;&#x5BF9;&#x6BD4;</strong></p>
<p>  &#x2003;&#x2003;ethereum&#x662F;&#x53D1;&#x8D77;&#x4EBA;&#x652F;&#x4ED8;&#x8D39;&#x7528;&#xFF08;gas&#xFF09;&#xFF0C;EOS&#x662F;&#x63A5;&#x53D7;&#x65B9;&#x4ED8;&#x8D39;&#x3002;eos&#x7684;&#x65B9;&#x5F0F;&#x66F4;&#x7B26;&#x5408;&#x73B0;&#x5728;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x8FD0;&#x884C;&#x65B9;&#x5F0F;&#x3002;&#x5373;&#x670D;&#x52A1;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x4E0D;&#x9700;&#x8981;&#x4ED8;&#x8D39;&#xFF0C;&#x800C;&#x63A5;&#x6536;&#x8005;&#x5904;&#x7406;&#x6D88;&#x606F;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8D44;&#x6E90;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x63A5;&#x6536;&#x65B9;&#x4E3A;&#x4E86;&#x4F7F;&#x7528;&#x8D44;&#x6E90;&#xFF0C;&#x9700;&#x8981;&#x6301;&#x6709;&#x4E00;&#x5B9A;&#x91CF;&#x7684;token&#x3002;EOS&#x8F6F;&#x4EF6;&#x6309;&#x7167;&#x8D26;&#x6237;&#x6301;&#x6709;token&#x7684;&#x6BD4;&#x4F8B;&#x7ED9;&#x8D26;&#x6237;&#x5206;&#x914D;&#x8D44;&#x6E90;&#x3002;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x8D26;&#x6237;&#x62E5;&#x6709;&#x6240;&#x6709;token&#x7684;&#x767E;&#x5206;&#x4E4B;&#x4E00;&#xFF0C;&#x5219;&#x4ED6;&#x6700;&#x591A;&#x4F7F;&#x7528;&#x767E;&#x5206;&#x4E4B;&#x4E00;&#x7684;RAM&#x8D44;&#x6E90;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981;&#x66F4;&#x9AD8;&#x6BD4;&#x4F8B;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x6301;&#x6709;&#x66F4;&#x9AD8;&#x6BD4;&#x4F8B;&#x7684;token&#x3002;</p>
</li>
<li><p><strong>EOS&#x8D44;&#x6E90;&#x7684;&#x4F7F;&#x7528;</strong></p>
<p>  &#x2003;&#x2003;EOS&#x91CC;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;1.&#x5E26;&#x5BBD;&#x3001;log&#x5B58;&#x50A8;&#xFF0C;&#x5373;&#x7F51;&#x7EDC;&#x548C; block&#x6570;&#x636E;&#xFF1B;2.&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#xFF0C;&#x5373;CPU&#xFF1B;3.&#x72B6;&#x6001;&#x5B58;&#x50A8;&#xFF0C;&#x5373;RAM&#x3002;</p>
<p>  &#x2003;&#x2003;&#x5BF9;&#x4E8E;&#x8D44;&#x6E90;&#x7684;&#x4F30;&#x8BA1;&#xFF0C;&#x662F;&#x7531;21&#x4E2A;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#x4E3B;&#x89C2;&#x5224;&#x65AD;&#x51B3;&#x5B9A;&#x7684;&#x3002;EOS&#x63D0;&#x4F9B;&#x4E86;&#x7B97;&#x6CD5;&#x8BA9;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#xFF0C;&#x4F46;&#x662F;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x81EA;&#x5DF1;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
</li>
<li><p><strong>CryptoCatties&#x4E3E;&#x4F8B;</strong></p>
<p>  &#x2003;&#x2003;&#x4EE5;&#x98CE;&#x9761;&#x4E00;&#x65F6;&#x7684;&#x4EE5;&#x592A;&#x732B;&#x4E3A;&#x4F8B;&#x3002;&#x56E0;&#x4E3A;&#x4EE5;&#x592A;&#x574A;&#x533A;&#x5757;&#x6709;gas limit&#xFF0C;&#x5F53;&#x4EE5;&#x592A;&#x732B;&#x7684;&#x8BBF;&#x95EE;&#x91CF;&#x975E;&#x5E38;&#x5927;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x9020;&#x6210;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x62E5;&#x5835;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x4E89;&#x62A2;&#x8D44;&#x6E90;&#x3002;&#x800C;&#x5982;&#x679C;&#x8FD0;&#x884C;&#x5728;EOS&#x4E0A;&#x5219;&#x4E0D;&#x4F1A;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5E76;&#x975E;&#x6309;&#x7167;transaction&#x7684;&#x4F7F;&#x7528;&#x6765;&#x8BBE;&#x7F6E;limit&#xFF0C;&#x800C;&#x4EE5;&#x592A;&#x732B;&#x7684;&#x8D26;&#x6237;&#xFF0C;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x6301;&#x6709;token&#x6BD4;&#x4F8B;&#x7684;&#x5E26;&#x5BBD;&#x548C;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x3002;</p>
</li>
<li><p><strong>&#x8BFE;&#x5802;&#x4F5C;&#x4E1A;</strong></p>
<p>  &#x2003;&#x2003;&#x5BF9;&#x4E8E;DDOS&#x653B;&#x51FB;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x4E0A;&#x53D1;&#x751F;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x548C;EOS&#x4E0A;&#x53D1;&#x751F;&#x7684;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF0C;&#x5404;&#x4F1A;&#x4EA7;&#x751F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5F71;&#x54CD;&#xFF1F;</p>
</li>
</ul>
<h2 id="governance">governance</h2>
<ul>
<li><p><strong>&#x5B9A;&#x4E49;</strong></p>
<p>  &#x2003;&#x2003;&#x901A;&#x8FC7;&#x4EBA;&#x7684;&#x4E3B;&#x89C2;&#x5224;&#x65AD;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7528;&#x4EE3;&#x7801;&#x6765;&#x8FBE;&#x6210;&#x7684;&#x5171;&#x8BC6;&#x3002;</p>
</li>
<li><p><strong>&#x5B58;&#x5728;&#x7684;&#x539F;&#x56E0;</strong></p>
<p>  &#x2003;&#x2003;EOS&#x8BA4;&#x4E3A;&#xFF0C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x9700;&#x8981;governance&#x7684;&#x5B58;&#x5728;&#x6765;&#x5904;&#x7406;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x8F6F;&#x4EF6;&#x7684;bug&#x3001;&#x4E25;&#x91CD;&#x7684;&#x5F02;&#x5E38;&#x3001;&#x8F6F;&#x4EF6;&#x7684;&#x5347;&#x7EA7;&#x3001;&#x7CFB;&#x7EDF;&#x53C2;&#x6570;&#x7684;&#x4FEE;&#x6539;&#x3002;</p>
</li>
<li><p><strong>&#x6781;&#x5927;&#x7684;&#x6743;&#x529B;</strong></p>
<p>  &#x2003;&#x2003;&#x5728;EOS&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;21&#x4E2A;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#x62E5;&#x6709;&#x6781;&#x5927;&#x7684;&#x6743;&#x529B;&#xFF0C;&#x53EA;&#x8981;21&#x4E2A;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#x4E2D;&#x7684;17&#x4E2A;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x5982;&#xFF1A;&#x51BB;&#x7ED3;&#x67D0;&#x4E2A;&#x8D26;&#x6237;&#x3001;&#x4FEE;&#x6539;&#x4E00;&#x4E2A;&#x8D26;&#x6237;&#x7684;&#x4EE3;&#x7801;&#x7B49;&#x3002;&#x7531;&#x4E8E;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#x662F;&#x52A8;&#x6001;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x6EE5;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x6743;&#x529B;&#xFF0C;&#x5219;&#x4F1A;&#x88AB;&#x793E;&#x533A;&#x6295;&#x7968;&#x51FA;&#x5C40;&#x3002;</p>
</li>
<li><p><strong>EOS&#x5BAA;&#x6CD5;&#x673A;&#x5236;</strong></p>
<p>  &#x2003;&#x2003;&#x8BE5;&#x673A;&#x5236;&#x4E0D;&#x8BE6;&#x7EC6;&#x8BBA;&#x8FF0;&#xFF0C;&#x8BE6;&#x89C1;&#x767D;&#x76AE;&#x4E66; &#x3002;</p>
</li>
<li><p><strong>governance&#x7684;&#x5229;&#x5F0A;</strong></p>
<p>  &#x5229;&#xFF1A;&#x5FEB;&#x901F;&#x54CD;&#x5E94;&#x3002;&#x5982;ethereum&#x5F53;&#x5E74;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x5982;&#x679C;&#x5FEB;&#x901F;&#x53CD;&#x5E94;&#x51BB;&#x7ED3;&#x4E86;&#x884C;&#x76D7;&#x7684;&#x8D26;&#x6237;&#xFF0C;&#x8FD9;&#x4E0D;&#x81F3;&#x4E8E;&#x5206;&#x53C9;&#x3002;</p>
<p>  &#x5F0A;&#xFF1A;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x3002;&#x5BA2;&#x89C2;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5E26;&#x7ED9;&#x6211;&#x4EEC;&#x5B89;&#x5168;&#x611F;&#xFF0C;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;&#x7684;&#x4E3B;&#x89C2;&#x5224;&#x65AD;&#x548C;&#x6781;&#x5927;&#x7684;&#x6743;&#x529B;&#x4F1A;&#x8BA9;&#x6211;&#x4EEC;&#x961F;&#x672A;&#x6765;&#x5145;&#x6EE1;&#x4E86;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x3002;</p>
</li>
</ul>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x2003;&#x2003;&#x8C26;&#x865A;&#x7684;&#x674E;&#x8001;&#x5E08;&#x8FD9;&#x6B21;&#x6682;&#x65F6;&#x6CA1;&#x6709;&#x5BF9;&#x8DE8;&#x94FE;&#x5904;&#x7406;&#x3001;&#x865A;&#x62DF;&#x673A;&#x8BBE;&#x8BA1;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#xFF0C;&#x6B22;&#x8FCE;&#x540C;&#x5B66;&#x4EEC;&#x4E00;&#x8D77;&#x5206;&#x4EAB;&#x8BA8;&#x8BBA;&#xFF01;</p>
<ul>
<li><p><strong>&#x76EE;&#x6807;&#x7684;&#x5B9E;&#x73B0;</strong></p>
<ol>
<li>Support Millions of users&#xFF1A;&#x901A;&#x8FC7;EOS&#x7684;&#x9AD8;&#x6027;&#x80FD;&#x3001;&#x9AD8;&#x5E76;&#x53D1;&#x89E3;&#x51B3;&#xFF1B;</li>
<li>Free usage&#xFF1A;&#x901A;&#x8FC7;token&#x6A21;&#x578B;&#x89E3;&#x51B3;&#xFF0C;&#x662F;&#x5411;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x8005;&#x6536;&#x8D39;&#xFF1B;</li>
<li>Easy upgrade and bug recovery&#xFF1A;&#x901A;&#x8FC7;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x8005;governance&#x5B9E;&#x73B0;&#xFF1B;</li>
<li>Low latency&#xFF1A;&#x5229;&#x7528;EOS&#x5E76;&#x884C;&#x5904;&#x7406;&#x7684;&#x8BBE;&#x8BA1;&#x4EE5;&#x53CA;DPOS&#x7684;&#x5171;&#x8BC6;&#x7B97;&#x6CD5;&#xFF1B;</li>
<li>Sequential performance&#xFF1A;&#x6682;&#x4E14;&#x6CA1;&#x5728;&#x767D;&#x76AE;&#x4E66;&#x4E2D;&#x770B;&#x5230;</li>
<li>Parallel performance&#xFF1A;&#x901A;&#x8FC7;thread&#x8FDB;&#x884C;&#x4E00;&#x4E2A;horizontal&#x7684;skill&#x6765;&#x89E3;&#x51B3;&#x3002;</li>
</ol>
</li>
<li><p><strong>EOS&#x5230;&#x5E95;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;OS</strong></p>
<p>  &#x2003;&#x2003;&#x9996;&#x5148;&#xFF0C;EOS&#x7684;&#x8BBE;&#x8BA1;&#x7ECF;&#x9A8C;&#x6765;&#x6E90;&#x4E8E;&#x4EE5;&#x524D;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#xFF0C;&#x5305;&#x62EC;DPOS&#x7684;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x81F3;&#x5C11;&#x6709;&#x4EE5;&#x524D;&#x9879;&#x76EE;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#x7684;&#x80CC;&#x4E66;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x5176;&#x6B21;&#xFF0C;EOS&#x662F;&#x4E00;&#x4E2A;&#x8FFD;&#x6C42;&#x6781;&#x81F4;&#x6027;&#x80FD;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E3A;&#x4E86;&#x6027;&#x80FD;&#x4E0D;&#x60DC;&#x628A;&#x4E00;&#x4E9B;&#x4E0A;&#x5C42;&#x7684;&#x529F;&#x80FD;&#x505A;&#x8FDB;&#x5E95;&#x5C42;&#xFF0C;&#x6BD4;&#x5982;&#x6743;&#x9650;&#x5904;&#x7406;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x540C;&#x65F6;&#xFF0C;EOS&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x5B8C;&#x6574;&#x7684;&#x3001;&#x66F4;&#x63A5;&#x8FD1;&#x7528;&#x6237;&#x573A;&#x666F;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x6BD4;&#x5982;&#x8D26;&#x6237;&#x627E;&#x56DE;&#x4E4B;&#x7C7B;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;EOS&#x4ECE;&#x7528;&#x6237;&#x7684;&#x89D2;&#x5EA6;&#x8003;&#x8651;&#x4E86;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x3002;</p>
<p>  &#x2003;&#x2003;&#x603B;&#x7ED3;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x56DB;&#x4E2A;&#x5B57;&#xFF0C;&#x5B9E;&#x7528;&#x4E3B;&#x4E49;&#x3002;&#x6709;&#x4E00;&#x79CD;&#x8BBE;&#x8BA1;&#x54F2;&#x5B66;&#x662F;&#x5C11;&#x5C31;&#x662F;&#x597D;&#xFF0C;&#x8981;&#x505A;&#x7CBE;&#x7B80;&#x3002;&#x80FD;&#x7ED9;&#x4E0A;&#x5C42;&#x505A;&#x7684;&#xFF0C;&#x4E00;&#x5B9A;&#x4E0D;&#x7559;&#x7ED9;&#x5E95;&#x5C42;&#xFF0C;&#x8FD9;&#x6837;&#x6765;&#x63D0;&#x4F9B;&#x66F4;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x4F46;&#x662F;EOS&#x4E0D;&#x60DC;&#x628A;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#x505A;&#x5927;&#x505A;&#x5168;&#xFF0C;&#x5176;&#x76EE;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FFD;&#x6C42;&#x7684;&#x5C31;&#x662F;&#x5B9E;&#x7528;&#x3002;</p>
</li>
</ul>
<h2 id="&#x9644;&#x5F55;">&#x9644;&#x5F55;</h2>
<p>&#x2003;&#x2003;<a href="https://steemit.com/dpos/@dantheman/dpos-consensus-algorithm-this-missing-white-paper" target="_blank">DPOS&#x76F8;&#x5173;&#x8BC1;&#x660E;</a></p>
<p>&#x2003;&#x2003;<a href="https://github.com/washingweb/eos-resources" target="_blank">EOS&#x5B66;&#x4E60;&#x8D44;&#x6599;&#x5206;&#x4EAB;</a></p>
<p>&#x2003;&#x2003;<a href="https://www.zhihu.com/question/265927960" target="_blank">&#x77E5;&#x4E4E;&#x7F51;&#x53CB;&#x5BF9;&#x4E8E;EOS&#x4EA4;&#x6613;&#x901F;&#x5EA6;&#x7684;&#x8BA8;&#x8BBA;</a></p>
<h2 id="&#x4F5C;&#x4E1A;&#x6C47;&#x603B;">&#x4F5C;&#x4E1A;&#x6C47;&#x603B;</h2>
<ol>
<li>&#x6211;&#x4EEC;&#x8BF4;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x5FC5;&#x987B;&#x53EF;&#x4EE5;replay&#xFF0C;&#x4F46;&#x662F;EOS&#x5F15;&#x5165;&#x4E86;&#x5E76;&#x884C;&#x5904;&#x7406;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4F7F;&#x5F97;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5185;&#x7684;transaction&#x53EF;&#x80FD;&#x5728;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#xFF0C;&#x4E3A;&#x4E86;&#x8FBE;&#x5230; replay&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#xFF0C;&#x4E0A;&#x56FE;&#x4E2D;block&#x3001;cycle&#x3001;thread&#x3001;transaction&#x3001;meassage&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x54EA;&#x4E9B;&#x5FC5;&#x987B;&#x8BB0;&#x5F55;&#x5728;&#x533A;&#x5757;&#x91CC;&#x5462;&#xFF1F;</li>
<li>&#x5199;&#x51FA;&#x4E00;&#x4E2A;&#x6700;&#x7B80;&#x5355;&#x7684;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;DDOS&#x653B;&#x51FB;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x4E0A;&#x53D1;&#x751F;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x548C;EOS&#x4E0A;&#x53D1;&#x751F;&#x7684;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF0C;&#x5404;&#x4F1A;&#x4EA7;&#x751F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5F71;&#x54CD;&#xFF1F;</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../chapter1/AELF.html" class="navigation navigation-prev " aria-label="Previous page: AELF分享复盘">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../chapter3/DIFINITY.html" class="navigation navigation-next " aria-label="Next page: Dfinity系列（一）——分层架构、阈值接力">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"EOS分享复盘","level":"2.2","depth":1,"next":{"title":"Dfinity系列（一）——分层架构、阈值接力","level":"2.3","depth":1,"path":"chapter3/DIFINITY.md","ref":"chapter3/DIFINITY.md","articles":[]},"previous":{"title":"AELF分享复盘","level":"2.1","depth":1,"path":"chapter1/AELF.md","ref":"chapter1/AELF.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter2/EOS.md","mtime":"2018-04-05T10:01:07.896Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-04-05T10:01:31.309Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

